NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_serial_handler_access.c
/* Copyright (c) 2010 - 2017, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <unity.h>
#include <cmock.h>

#include "serial_handler_access.h"
#include "nrf_mesh_config_serial.h"
#include "serial_status.h"
#include "serial_mock.h"
#include "access_config_mock.h"
#include "access_mock.h"

#define RX_PACK_INVALID_PACK_LENGTH(CMD, MIN, MAX)  do \
                                                    { \
                                                        CMD.length = (MIN)-1;   \
                                                        serial_cmd_rsp_send_Expect(CMD.opcode, SERIAL_STATUS_ERROR_INVALID_LENGTH, NULL, 0);   \
                                                        serial_handler_access_rx(&cmd); \
                                                        CMD.length = (MAX)+1;   \
                                                        serial_cmd_rsp_send_Expect(CMD.opcode, SERIAL_STATUS_ERROR_INVALID_LENGTH, NULL, 0);   \
                                                        serial_handler_access_rx(&cmd); \
                                                    } while (0)
nrf_mesh_assertion_handler_t m_assertion_handler;
static void assertion_handler(uint32_t pc)
{
    TEST_FAIL_MESSAGE("ASSERT");
}

static void test_access_model_pub_addr_set()
{
    serial_packet_t cmd;
    cmd.opcode = SERIAL_OPCODE_CMD_ACCESS_MODEL_PUB_ADDR_SET;
    RX_PACK_INVALID_PACK_LENGTH(cmd, SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_handle_pair_t), SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_handle_pair_t));

    cmd.length = SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_handle_pair_t);
    access_model_publish_address_set_ExpectAndReturn(0, 0, NRF_SUCCESS);
    access_model_publish_address_set_IgnoreArg_handle();
    access_model_publish_address_set_IgnoreArg_address_handle();
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_MODEL_PUB_ADDR_SET, SERIAL_STATUS_SUCCESS, NULL, 0);
    serial_handler_access_rx(&cmd);

    access_model_publish_address_set_ExpectAndReturn(0, 0, NRF_ERROR_NO_MEM);
    access_model_publish_address_set_IgnoreArg_handle();
    access_model_publish_address_set_IgnoreArg_address_handle();
    serial_translate_error_ExpectAndReturn(NRF_ERROR_NO_MEM, SERIAL_STATUS_ERROR_REJECTED);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_MODEL_PUB_ADDR_SET, SERIAL_STATUS_ERROR_REJECTED, NULL, 0);
    serial_handler_access_rx(&cmd);
}

static void test_access_model_pub_addr_get()
{
    serial_packet_t cmd;
    cmd.opcode = SERIAL_OPCODE_CMD_ACCESS_MODEL_PUB_ADDR_GET;
    RX_PACK_INVALID_PACK_LENGTH(cmd, SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_model_handle_t), SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_model_handle_t));

    cmd.length = SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_model_handle_t);
    access_model_publish_address_get_ExpectAndReturn(0, NULL, NRF_SUCCESS);
    access_model_publish_address_get_IgnoreArg_handle();
    access_model_publish_address_get_IgnoreArg_p_address_handle();
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_MODEL_PUB_ADDR_GET, SERIAL_STATUS_SUCCESS, NULL, sizeof(serial_evt_cmd_rsp_data_model_pub_addr_get_t));
    serial_cmd_rsp_send_IgnoreArg_p_data();
    serial_handler_access_rx(&cmd);

    access_model_publish_address_get_ExpectAndReturn(0, NULL, NRF_ERROR_NO_MEM);
    access_model_publish_address_get_IgnoreArg_handle();
    access_model_publish_address_get_IgnoreArg_p_address_handle();
    serial_translate_error_ExpectAndReturn(NRF_ERROR_NO_MEM, SERIAL_STATUS_ERROR_REJECTED);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_MODEL_PUB_ADDR_GET, SERIAL_STATUS_ERROR_REJECTED, NULL, 0);
    serial_cmd_rsp_send_IgnoreArg_p_data();
    serial_handler_access_rx(&cmd);
}

static void test_access_model_pub_period_set()
{
    serial_packet_t cmd;
    cmd.opcode = SERIAL_OPCODE_CMD_ACCESS_MODEL_PUB_PERIOD_SET;
    RX_PACK_INVALID_PACK_LENGTH(cmd, SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_pub_period_set_t), SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_pub_period_set_t));
    cmd.length = SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_pub_period_set_t);
    access_model_publish_period_set_ExpectAndReturn(0, (access_publish_resolution_t) 0, 0, NRF_SUCCESS);
    access_model_publish_period_set_IgnoreArg_resolution();
    access_model_publish_period_set_IgnoreArg_handle();
    access_model_publish_period_set_IgnoreArg_step_number();
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_MODEL_PUB_PERIOD_SET, SERIAL_STATUS_SUCCESS, NULL, 0);
    serial_handler_access_rx(&cmd);

    access_model_publish_period_set_ExpectAndReturn(0, (access_publish_resolution_t) 0, 0, NRF_ERROR_NO_MEM);
    access_model_publish_period_set_IgnoreArg_resolution();
    access_model_publish_period_set_IgnoreArg_handle();
    access_model_publish_period_set_IgnoreArg_step_number();
    serial_translate_error_ExpectAndReturn(NRF_ERROR_NO_MEM, SERIAL_STATUS_ERROR_REJECTED);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_MODEL_PUB_PERIOD_SET, SERIAL_STATUS_ERROR_REJECTED, NULL, 0);
    serial_handler_access_rx(&cmd);
}

static void test_access_model_pub_period_get()
{
    serial_packet_t cmd;
    cmd.opcode = SERIAL_OPCODE_CMD_ACCESS_MODEL_PUB_PERIOD_GET;
    RX_PACK_INVALID_PACK_LENGTH(cmd, SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_model_handle_t), SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_model_handle_t));
    cmd.length = SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_model_handle_t);
    access_model_publish_period_get_ExpectAndReturn(0, NULL, NULL, NRF_SUCCESS);
    access_model_publish_period_get_IgnoreArg_handle();
    access_model_publish_period_get_IgnoreArg_p_resolution();
    access_model_publish_period_get_IgnoreArg_p_step_number();
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_MODEL_PUB_PERIOD_GET, SERIAL_STATUS_SUCCESS, NULL, sizeof(serial_evt_cmd_rsp_data_model_pub_period_get_t));
    serial_cmd_rsp_send_IgnoreArg_p_data();
    serial_handler_access_rx(&cmd);

    access_model_publish_period_get_ExpectAndReturn(0, NULL, NULL, NRF_ERROR_NO_MEM);
    access_model_publish_period_get_IgnoreArg_handle();
    access_model_publish_period_get_IgnoreArg_p_resolution();
    access_model_publish_period_get_IgnoreArg_p_step_number();
    serial_translate_error_ExpectAndReturn(NRF_ERROR_NO_MEM, SERIAL_STATUS_ERROR_REJECTED);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_MODEL_PUB_PERIOD_GET, SERIAL_STATUS_ERROR_REJECTED, NULL, 0);
    serial_cmd_rsp_send_IgnoreArg_p_data();
    serial_handler_access_rx(&cmd);
}

static void test_access_model_subs_add()
{
    serial_packet_t cmd;
    cmd.opcode = SERIAL_OPCODE_CMD_ACCESS_MODEL_SUBS_ADD;
    RX_PACK_INVALID_PACK_LENGTH(cmd, SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_handle_pair_t), SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_handle_pair_t));
    cmd.length = SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_handle_pair_t);
    access_model_subscription_add_ExpectAndReturn(0, 0, NRF_SUCCESS);
    access_model_subscription_add_IgnoreArg_handle();
    access_model_subscription_add_IgnoreArg_address_handle();
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_MODEL_SUBS_ADD, SERIAL_STATUS_SUCCESS, NULL, 0);
    serial_handler_access_rx(&cmd);

    access_model_subscription_add_ExpectAndReturn(0, 0, NRF_ERROR_NO_MEM);
    access_model_subscription_add_IgnoreArg_handle();
    access_model_subscription_add_IgnoreArg_address_handle();
    serial_translate_error_ExpectAndReturn(NRF_ERROR_NO_MEM, SERIAL_STATUS_ERROR_REJECTED);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_MODEL_SUBS_ADD, SERIAL_STATUS_ERROR_REJECTED, NULL, 0);
    serial_handler_access_rx(&cmd);
}

static void test_access_model_subs_remove()
{
    serial_packet_t cmd;
    cmd.opcode = SERIAL_OPCODE_CMD_ACCESS_MODEL_SUBS_REMOVE;
    RX_PACK_INVALID_PACK_LENGTH(cmd, SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_handle_pair_t), SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_handle_pair_t));
    cmd.length = SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_handle_pair_t);
    access_model_subscription_remove_ExpectAndReturn(0, 0, NRF_SUCCESS);
    access_model_subscription_remove_IgnoreArg_handle();
    access_model_subscription_remove_IgnoreArg_address_handle();
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_MODEL_SUBS_REMOVE, SERIAL_STATUS_SUCCESS, NULL, 0);
    serial_handler_access_rx(&cmd);

    access_model_subscription_remove_ExpectAndReturn(0, 0, NRF_ERROR_NO_MEM);
    access_model_subscription_remove_IgnoreArg_handle();
    access_model_subscription_remove_IgnoreArg_address_handle();
    serial_translate_error_ExpectAndReturn(NRF_ERROR_NO_MEM, SERIAL_STATUS_ERROR_REJECTED);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_MODEL_SUBS_REMOVE, SERIAL_STATUS_ERROR_REJECTED, NULL, 0);
    serial_handler_access_rx(&cmd);
}

