NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_serial_handler_access.c
static void test_access_model_subs_get()
{
    serial_packet_t cmd;
    cmd.opcode = SERIAL_OPCODE_CMD_ACCESS_MODEL_SUBS_GET;
    RX_PACK_INVALID_PACK_LENGTH(cmd, SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_model_handle_t), SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_model_handle_t));
    cmd.length = SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_model_handle_t);
    access_model_subscriptions_get_ExpectAndReturn(0, NULL, NULL, NRF_SUCCESS);
    access_model_subscriptions_get_IgnoreArg_handle();
    access_model_subscriptions_get_IgnoreArg_p_count();
    access_model_subscriptions_get_IgnoreArg_p_address_handles();
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_MODEL_SUBS_GET, SERIAL_STATUS_SUCCESS, NULL, sizeof(serial_evt_cmd_rsp_data_model_subs_get_t));
    serial_cmd_rsp_send_IgnoreArg_p_data();
    serial_handler_access_rx(&cmd);

    access_model_subscriptions_get_ExpectAndReturn(0, NULL, NULL, NRF_ERROR_INVALID_LENGTH);
    access_model_subscriptions_get_IgnoreArg_handle();
    access_model_subscriptions_get_IgnoreArg_p_count();
    access_model_subscriptions_get_IgnoreArg_p_address_handles();
    serial_translate_error_ExpectAndReturn(NRF_ERROR_INVALID_LENGTH, SERIAL_STATUS_ERROR_INVALID_LENGTH);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_MODEL_SUBS_GET, SERIAL_STATUS_ERROR_INVALID_LENGTH, NULL, sizeof(serial_evt_cmd_rsp_data_model_subs_get_t));
    serial_cmd_rsp_send_IgnoreArg_p_data();
    serial_handler_access_rx(&cmd);

    access_model_subscriptions_get_ExpectAndReturn(0, NULL, NULL, NRF_ERROR_NO_MEM);
    access_model_subscriptions_get_IgnoreArg_handle();
    access_model_subscriptions_get_IgnoreArg_p_count();
    access_model_subscriptions_get_IgnoreArg_p_address_handles();
    serial_translate_error_ExpectAndReturn(NRF_ERROR_NO_MEM, SERIAL_STATUS_ERROR_REJECTED);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_MODEL_SUBS_GET, SERIAL_STATUS_ERROR_REJECTED, NULL, 0);
    serial_cmd_rsp_send_IgnoreArg_p_data();
    serial_handler_access_rx(&cmd);
}

static void test_access_model_app_bind()
{
    serial_packet_t cmd;
    cmd.opcode = SERIAL_OPCODE_CMD_ACCESS_MODEL_APP_BIND;
    RX_PACK_INVALID_PACK_LENGTH(cmd, SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_handle_pair_t), SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_handle_pair_t));
    cmd.length = SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_handle_pair_t);
    access_model_application_bind_ExpectAndReturn(0, 0, NRF_SUCCESS);
    access_model_application_bind_IgnoreArg_handle();
    access_model_application_bind_IgnoreArg_appkey_handle();
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_MODEL_APP_BIND, SERIAL_STATUS_SUCCESS, NULL, 0);
    serial_handler_access_rx(&cmd);

    access_model_application_bind_ExpectAndReturn(0, 0, NRF_ERROR_NO_MEM);
    access_model_application_bind_IgnoreArg_handle();
    access_model_application_bind_IgnoreArg_appkey_handle();
    serial_translate_error_ExpectAndReturn(NRF_ERROR_NO_MEM, SERIAL_STATUS_ERROR_REJECTED);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_MODEL_APP_BIND, SERIAL_STATUS_ERROR_REJECTED, NULL, 0);
    serial_handler_access_rx(&cmd);
}

static void test_access_model_app_unbind()
{
    serial_packet_t cmd;
    cmd.opcode = SERIAL_OPCODE_CMD_ACCESS_MODEL_APP_UNBIND;
    RX_PACK_INVALID_PACK_LENGTH(cmd, SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_handle_pair_t), SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_handle_pair_t));
    cmd.length = SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_handle_pair_t);
    access_model_application_unbind_ExpectAndReturn(0, 0, NRF_SUCCESS);
    access_model_application_unbind_IgnoreArg_handle();
    access_model_application_unbind_IgnoreArg_appkey_handle();
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_MODEL_APP_UNBIND, SERIAL_STATUS_SUCCESS, NULL, 0);
    serial_handler_access_rx(&cmd);

    access_model_application_unbind_ExpectAndReturn(0, 0, NRF_ERROR_NO_MEM);
    access_model_application_unbind_IgnoreArg_handle();
    access_model_application_unbind_IgnoreArg_appkey_handle();
    serial_translate_error_ExpectAndReturn(NRF_ERROR_NO_MEM, SERIAL_STATUS_ERROR_REJECTED);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_MODEL_APP_UNBIND, SERIAL_STATUS_ERROR_REJECTED, NULL, 0);
    serial_handler_access_rx(&cmd);
}

static void test_access_model_app_get()
{
    serial_packet_t cmd;
    cmd.opcode = SERIAL_OPCODE_CMD_ACCESS_MODEL_APP_GET;
    RX_PACK_INVALID_PACK_LENGTH(cmd, SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_model_handle_t), SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_model_handle_t));
    cmd.length = SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_model_handle_t);
    access_model_applications_get_ExpectAndReturn(0, NULL, NULL, NRF_SUCCESS);
    access_model_applications_get_IgnoreArg_handle();
    access_model_applications_get_IgnoreArg_p_count();
    access_model_applications_get_IgnoreArg_p_appkey_handles();
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_MODEL_APP_GET, SERIAL_STATUS_SUCCESS, NULL, sizeof(serial_evt_cmd_rsp_data_model_apps_get_t));
    serial_cmd_rsp_send_IgnoreArg_p_data();
    serial_handler_access_rx(&cmd);

    access_model_applications_get_ExpectAndReturn(0, NULL, NULL, NRF_ERROR_INVALID_LENGTH);
    access_model_applications_get_IgnoreArg_handle();
    access_model_applications_get_IgnoreArg_p_count();
    access_model_applications_get_IgnoreArg_p_appkey_handles();
    serial_translate_error_ExpectAndReturn(NRF_ERROR_INVALID_LENGTH, SERIAL_STATUS_ERROR_INVALID_LENGTH);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_MODEL_APP_GET, SERIAL_STATUS_ERROR_INVALID_LENGTH, NULL, sizeof(serial_evt_cmd_rsp_data_model_apps_get_t));
    serial_cmd_rsp_send_IgnoreArg_p_data();
    serial_handler_access_rx(&cmd);

