NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_serial_handler_access.c
    access_model_applications_get_ExpectAndReturn(0, NULL, NULL, NRF_ERROR_NO_MEM);
    access_model_applications_get_IgnoreArg_handle();
    access_model_applications_get_IgnoreArg_p_count();
    access_model_applications_get_IgnoreArg_p_appkey_handles();
    serial_translate_error_ExpectAndReturn(NRF_ERROR_NO_MEM, SERIAL_STATUS_ERROR_REJECTED);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_MODEL_APP_GET, SERIAL_STATUS_ERROR_REJECTED, NULL, 0);
    serial_cmd_rsp_send_IgnoreArg_p_data();
    serial_handler_access_rx(&cmd);
}

static void test_access_model_pub_app_set()
{
    serial_packet_t cmd;
    cmd.opcode = SERIAL_OPCODE_CMD_ACCESS_MODEL_PUB_APP_SET;
    RX_PACK_INVALID_PACK_LENGTH(cmd, SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_handle_pair_t), SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_handle_pair_t));
    cmd.length = SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_handle_pair_t);
    access_model_publish_application_set_ExpectAndReturn(0, 0, NRF_SUCCESS);
    access_model_publish_application_set_IgnoreArg_handle();
    access_model_publish_application_set_IgnoreArg_appkey_handle();
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_MODEL_PUB_APP_SET, SERIAL_STATUS_SUCCESS, NULL, 0);
    serial_handler_access_rx(&cmd);

    access_model_publish_application_set_ExpectAndReturn(0, 0, NRF_ERROR_NO_MEM);
    access_model_publish_application_set_IgnoreArg_handle();
    access_model_publish_application_set_IgnoreArg_appkey_handle();
    serial_translate_error_ExpectAndReturn(NRF_ERROR_NO_MEM, SERIAL_STATUS_ERROR_REJECTED);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_MODEL_PUB_APP_SET, SERIAL_STATUS_ERROR_REJECTED, NULL, 0);
    serial_handler_access_rx(&cmd);
}

static void test_access_model_pub_app_get()
{
    serial_packet_t cmd;
    cmd.opcode = SERIAL_OPCODE_CMD_ACCESS_MODEL_PUB_APP_GET;
    RX_PACK_INVALID_PACK_LENGTH(cmd, SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_model_handle_t), SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_model_handle_t));
    cmd.length = SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_model_handle_t);
    access_model_publish_application_get_ExpectAndReturn(0, NULL, NRF_SUCCESS);
    access_model_publish_application_get_IgnoreArg_handle();
    access_model_publish_application_get_IgnoreArg_p_appkey_handle();
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_MODEL_PUB_APP_GET, SERIAL_STATUS_SUCCESS, NULL, sizeof(serial_evt_cmd_rsp_data_model_pub_app_get_t));
    serial_cmd_rsp_send_IgnoreArg_p_data();
    serial_handler_access_rx(&cmd);

    access_model_publish_application_get_ExpectAndReturn(0, NULL, NRF_ERROR_NO_MEM);
    access_model_publish_application_get_IgnoreArg_handle();
    access_model_publish_application_get_IgnoreArg_p_appkey_handle();
    serial_translate_error_ExpectAndReturn(NRF_ERROR_NO_MEM, SERIAL_STATUS_ERROR_REJECTED);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_MODEL_PUB_APP_GET, SERIAL_STATUS_ERROR_REJECTED, NULL, 0);
    serial_cmd_rsp_send_IgnoreArg_p_data();
    serial_handler_access_rx(&cmd);
}

static void test_access_model_pub_ttl_set()
{
    serial_packet_t cmd;
    cmd.opcode = SERIAL_OPCODE_CMD_ACCESS_MODEL_PUB_TTL_SET;
    RX_PACK_INVALID_PACK_LENGTH(cmd, SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_model_pub_ttl_set_t), SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_model_pub_ttl_set_t));
    cmd.length = SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_model_pub_ttl_set_t);
    access_model_publish_ttl_set_ExpectAndReturn(0, 0, NRF_SUCCESS);
    access_model_publish_ttl_set_IgnoreArg_handle();
    access_model_publish_ttl_set_IgnoreArg_ttl();
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_MODEL_PUB_TTL_SET, SERIAL_STATUS_SUCCESS, NULL, 0);
    serial_handler_access_rx(&cmd);

    access_model_publish_ttl_set_ExpectAndReturn(0, 0, NRF_ERROR_NO_MEM);
    access_model_publish_ttl_set_IgnoreArg_handle();
    access_model_publish_ttl_set_IgnoreArg_ttl();
    serial_translate_error_ExpectAndReturn(NRF_ERROR_NO_MEM, SERIAL_STATUS_ERROR_REJECTED);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_MODEL_PUB_TTL_SET, SERIAL_STATUS_ERROR_REJECTED, NULL, 0);
    serial_handler_access_rx(&cmd);
}

static void test_access_model_pub_ttl_get()
{
    serial_packet_t cmd;
    cmd.opcode = SERIAL_OPCODE_CMD_ACCESS_MODEL_PUB_TTL_GET;
    RX_PACK_INVALID_PACK_LENGTH(cmd, SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_model_handle_t), SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_model_handle_t));
    cmd.length = SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_model_handle_t);
    access_model_publish_ttl_get_ExpectAndReturn(0, NULL, NRF_SUCCESS);
    access_model_publish_ttl_get_IgnoreArg_handle();
    access_model_publish_ttl_get_IgnoreArg_p_ttl();
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_MODEL_PUB_TTL_GET, SERIAL_STATUS_SUCCESS, NULL, sizeof(serial_evt_cmd_rsp_data_model_pub_ttl_get_t));
    serial_cmd_rsp_send_IgnoreArg_p_data();
    serial_handler_access_rx(&cmd);

    access_model_publish_ttl_get_ExpectAndReturn(0, NULL, NRF_ERROR_NO_MEM);
    access_model_publish_ttl_get_IgnoreArg_handle();
    access_model_publish_ttl_get_IgnoreArg_p_ttl();
    serial_translate_error_ExpectAndReturn(NRF_ERROR_NO_MEM, SERIAL_STATUS_ERROR_REJECTED);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_MODEL_PUB_TTL_GET, SERIAL_STATUS_ERROR_REJECTED, NULL, 0);
    serial_cmd_rsp_send_IgnoreArg_p_data();
    serial_handler_access_rx(&cmd);

}
static void test_access_elem_loc_set()
{
    serial_packet_t cmd;
    cmd.opcode = SERIAL_OPCODE_CMD_ACCESS_ELEM_LOC_SET;
    RX_PACK_INVALID_PACK_LENGTH(cmd, SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_element_loc_set_t), SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_element_loc_set_t));
    cmd.length = SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_element_loc_set_t);
    access_element_location_set_ExpectAndReturn(0, 0, NRF_SUCCESS);
    access_element_location_set_IgnoreArg_element_index();
    access_element_location_set_IgnoreArg_location();
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_ELEM_LOC_SET, SERIAL_STATUS_SUCCESS, NULL, 0);
    serial_handler_access_rx(&cmd);

    access_element_location_set_ExpectAndReturn(0, 0, NRF_ERROR_NO_MEM);
    access_element_location_set_IgnoreArg_element_index();
    access_element_location_set_IgnoreArg_location();
    serial_translate_error_ExpectAndReturn(NRF_ERROR_NO_MEM, SERIAL_STATUS_ERROR_REJECTED);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_ELEM_LOC_SET, SERIAL_STATUS_ERROR_REJECTED, NULL, 0);
    serial_handler_access_rx(&cmd);
}

static void test_access_elem_loc_get()
{
    serial_packet_t cmd;
    cmd.opcode = SERIAL_OPCODE_CMD_ACCESS_ELEM_LOC_GET;
    RX_PACK_INVALID_PACK_LENGTH(cmd, SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_element_index_t), SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_element_index_t));
    cmd.length = SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_element_index_t);
    access_element_location_get_ExpectAndReturn(0, NULL, NRF_SUCCESS);
    access_element_location_get_IgnoreArg_element_index();
    access_element_location_get_IgnoreArg_p_location();
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_ELEM_LOC_GET, SERIAL_STATUS_SUCCESS, NULL, sizeof(serial_evt_cmd_rsp_data_elem_loc_get_t));
    serial_cmd_rsp_send_IgnoreArg_p_data();
    serial_handler_access_rx(&cmd);

    access_element_location_get_ExpectAndReturn(0, NULL, NRF_ERROR_NO_MEM);
    access_element_location_get_IgnoreArg_element_index();
    access_element_location_get_IgnoreArg_p_location();
    serial_translate_error_ExpectAndReturn(NRF_ERROR_NO_MEM, SERIAL_STATUS_ERROR_REJECTED);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_ELEM_LOC_GET, SERIAL_STATUS_ERROR_REJECTED, NULL, 0);
    serial_cmd_rsp_send_IgnoreArg_p_data();
    serial_handler_access_rx(&cmd);
}

static void test_access_elem_sig_model_count_get()
{
    serial_packet_t cmd;
    cmd.opcode = SERIAL_OPCODE_CMD_ACCESS_ELEM_SIG_MODEL_COUNT_GET;
    RX_PACK_INVALID_PACK_LENGTH(cmd, SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_element_index_t), SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_element_index_t));
    cmd.length = SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_element_index_t);
    access_element_sig_model_count_get_ExpectAndReturn(0, NULL, NRF_SUCCESS);
    access_element_sig_model_count_get_IgnoreArg_element_index();
    access_element_sig_model_count_get_IgnoreArg_p_sig_model_count();
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_ELEM_SIG_MODEL_COUNT_GET, SERIAL_STATUS_SUCCESS, NULL, sizeof(serial_evt_cmd_rsp_data_elem_model_count_get_t));
    serial_cmd_rsp_send_IgnoreArg_p_data();
    serial_handler_access_rx(&cmd);

    access_element_sig_model_count_get_ExpectAndReturn(0, NULL, NRF_ERROR_NO_MEM);
    access_element_sig_model_count_get_IgnoreArg_element_index();
    access_element_sig_model_count_get_IgnoreArg_p_sig_model_count();
    serial_translate_error_ExpectAndReturn(NRF_ERROR_NO_MEM, SERIAL_STATUS_ERROR_REJECTED);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_ELEM_SIG_MODEL_COUNT_GET, SERIAL_STATUS_ERROR_REJECTED, NULL, 0);
    serial_cmd_rsp_send_IgnoreArg_p_data();
    serial_handler_access_rx(&cmd);
}

