NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_serial_handler_access.c
static void test_access_elem_vendor_model_count_get()
{
    serial_packet_t cmd;
    cmd.opcode = SERIAL_OPCODE_CMD_ACCESS_ELEM_VENDOR_MODEL_COUNT_GET;
    RX_PACK_INVALID_PACK_LENGTH(cmd, SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_element_index_t), SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_element_index_t));
    cmd.length = SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_element_index_t);
    access_element_vendor_model_count_get_ExpectAndReturn(0, NULL, NRF_SUCCESS);
    access_element_vendor_model_count_get_IgnoreArg_element_index();
    access_element_vendor_model_count_get_IgnoreArg_p_vendor_model_count();
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_ELEM_VENDOR_MODEL_COUNT_GET, SERIAL_STATUS_SUCCESS, NULL, sizeof(serial_evt_cmd_rsp_data_elem_model_count_get_t));
    serial_cmd_rsp_send_IgnoreArg_p_data();
    serial_handler_access_rx(&cmd);

    access_element_vendor_model_count_get_ExpectAndReturn(0, NULL, NRF_ERROR_NO_MEM);
    access_element_vendor_model_count_get_IgnoreArg_element_index();
    access_element_vendor_model_count_get_IgnoreArg_p_vendor_model_count();
    serial_translate_error_ExpectAndReturn(NRF_ERROR_NO_MEM, SERIAL_STATUS_ERROR_REJECTED);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_ELEM_VENDOR_MODEL_COUNT_GET, SERIAL_STATUS_ERROR_REJECTED, NULL, 0);
    serial_cmd_rsp_send_IgnoreArg_p_data();
    serial_handler_access_rx(&cmd);
}

static void test_access_model_id_get()
{
    serial_packet_t cmd;
    cmd.opcode = SERIAL_OPCODE_CMD_ACCESS_MODEL_ID_GET;
    RX_PACK_INVALID_PACK_LENGTH(cmd, SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_model_handle_t), SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_model_handle_t));
    cmd.length = SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_model_handle_t);
    access_model_id_get_ExpectAndReturn(0, NULL, NRF_SUCCESS);
    access_model_id_get_IgnoreArg_handle();
    access_model_id_get_IgnoreArg_p_model_id();
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_MODEL_ID_GET, SERIAL_STATUS_SUCCESS, NULL, sizeof(serial_evt_cmd_rsp_data_model_id_get_t));
    serial_cmd_rsp_send_IgnoreArg_p_data();
    serial_handler_access_rx(&cmd);

    access_model_id_get_ExpectAndReturn(0, NULL, NRF_ERROR_NO_MEM);
    access_model_id_get_IgnoreArg_handle();
    access_model_id_get_IgnoreArg_p_model_id();
    serial_translate_error_ExpectAndReturn(NRF_ERROR_NO_MEM, SERIAL_STATUS_ERROR_REJECTED);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_MODEL_ID_GET, SERIAL_STATUS_ERROR_REJECTED, NULL, 0);
    serial_cmd_rsp_send_IgnoreArg_p_data();
    serial_handler_access_rx(&cmd);
}

static void test_access_handle_get()
{
    serial_packet_t cmd;
    cmd.opcode = SERIAL_OPCODE_CMD_ACCESS_HANDLE_GET;
    access_model_id_t dummy = {};
    RX_PACK_INVALID_PACK_LENGTH(cmd, SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_handle_get_t), SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_handle_get_t));
    cmd.length = SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_handle_get_t);
    access_handle_get_ExpectAndReturn(0, dummy, NULL, NRF_SUCCESS);
    access_handle_get_IgnoreArg_model_id();
    access_handle_get_IgnoreArg_element_index();
    access_handle_get_IgnoreArg_p_handle();
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_HANDLE_GET, SERIAL_STATUS_SUCCESS, NULL, sizeof(serial_evt_cmd_rsp_data_model_handle_get_t));
    serial_cmd_rsp_send_IgnoreArg_p_data();
    serial_handler_access_rx(&cmd);

    access_handle_get_ExpectAndReturn(0, dummy, NULL, NRF_ERROR_NO_MEM);
    access_handle_get_IgnoreArg_model_id();
    access_handle_get_IgnoreArg_element_index();
    access_handle_get_IgnoreArg_p_handle();
    serial_translate_error_ExpectAndReturn(NRF_ERROR_NO_MEM, SERIAL_STATUS_ERROR_REJECTED);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_HANDLE_GET, SERIAL_STATUS_ERROR_REJECTED, NULL, 0);
    serial_cmd_rsp_send_IgnoreArg_p_data();
    serial_handler_access_rx(&cmd);

}
static void test_access_elem_models_get()
{
    serial_packet_t cmd;
    cmd.opcode = SERIAL_OPCODE_CMD_ACCESS_ELEM_MODELS_GET;
    RX_PACK_INVALID_PACK_LENGTH(cmd, SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_element_index_t), SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_element_index_t));
    cmd.length = SERIAL_PACKET_LENGTH_OVERHEAD + sizeof(serial_cmd_access_element_index_t);
    access_element_models_get_ExpectAndReturn(0, NULL, NULL, NRF_SUCCESS);
    access_element_models_get_IgnoreArg_element_index();
    access_element_models_get_IgnoreArg_p_count();
    access_element_models_get_IgnoreArg_p_models();
    serial_translate_error_ExpectAndReturn(NRF_SUCCESS, SERIAL_STATUS_SUCCESS);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_ELEM_MODELS_GET, SERIAL_STATUS_SUCCESS, NULL, sizeof(serial_evt_cmd_rsp_data_elem_models_get_t));
    serial_cmd_rsp_send_IgnoreArg_p_data();
    serial_handler_access_rx(&cmd);

    access_element_models_get_ExpectAndReturn(0, NULL, NULL, NRF_ERROR_INVALID_LENGTH);
    access_element_models_get_IgnoreArg_element_index();
    access_element_models_get_IgnoreArg_p_count();
    access_element_models_get_IgnoreArg_p_models();
    serial_translate_error_ExpectAndReturn(NRF_ERROR_INVALID_LENGTH, SERIAL_STATUS_ERROR_INVALID_LENGTH);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_ELEM_MODELS_GET, SERIAL_STATUS_ERROR_INVALID_LENGTH, NULL, sizeof(serial_evt_cmd_rsp_data_elem_models_get_t));
    serial_cmd_rsp_send_IgnoreArg_p_data();
    serial_handler_access_rx(&cmd);

    access_element_models_get_ExpectAndReturn(0, NULL, NULL, NRF_ERROR_NO_MEM);
    access_element_models_get_IgnoreArg_element_index();
    access_element_models_get_IgnoreArg_p_count();
    access_element_models_get_IgnoreArg_p_models();
    serial_translate_error_ExpectAndReturn(NRF_ERROR_NO_MEM, SERIAL_STATUS_ERROR_REJECTED);
    serial_cmd_rsp_send_Expect(SERIAL_OPCODE_CMD_ACCESS_ELEM_MODELS_GET, SERIAL_STATUS_ERROR_REJECTED, NULL, 0);
    serial_cmd_rsp_send_IgnoreArg_p_data();
    serial_handler_access_rx(&cmd);

